nick-lavrik/esp32/lib/MqttClient/MqttClient.cpp
#include "MqttClient.hpp"
#include <Arduino.h>
#include <Logger.hpp>

#if defined(ESP8266)
#include <ESP8266WiFi.h>
#else
#include <WiFi.h>
#endif

#include <algorithm>
#include "MqttTopicMatcher.hpp"

#if HAS_MQTT_CLIENT

#if __has_include(<PubSubClient.h>) // || true
MqttClient* MqttClient::_instance = nullptr;
#endif

MqttClient::MqttClient(const MqttConfig& config)
    : _config(config), _defaultKeyGenerator(config.prefix)
#if __has_include(<PicoMQTT.h>)
      // Явний WiFiClient (_picoWifiClient) замість дефолтного heap-варіанту
      // PicoMQTT - див. коментар біля _picoWifiClient в .hpp. Templated
      // конструктор: Client(ClientType&, host, port, id, user, password,
      // reconnect_interval_millis, keep_alive_millis, socket_timeout_millis).
      , _mqttClient(_picoWifiClient, config.host, config.port, config.clientId,
                  config.username, config.password, 5000, 60000, 5000)
#endif
     {
#if defined(ESP32)
  _networkMutex = xSemaphoreCreateMutex();
  _queueMutex = xSemaphoreCreateMutex();
  _listenersMutex = xSemaphoreCreateMutex();
#if __has_include(<PicoMQTT.h>)
  _outgoingQueueMutex = xSemaphoreCreateMutex();
#endif
#endif
}

MqttClient::~MqttClient() {
#if defined(ESP32)
  _taskShouldRun = false;
  // Даємо таску шанс самому вийти з циклу (див. networkTaskLoop) перш ніж
  // видаляти мьютекси, якими він міг ще користуватись.
  if (_networkTaskHandle != nullptr) {
    vTaskDelay(pdMS_TO_TICKS(50));
    vTaskDelete(_networkTaskHandle);
    _networkTaskHandle = nullptr;
  }
  if (_networkMutex != nullptr) { vSemaphoreDelete(_networkMutex); }
  if (_queueMutex != nullptr) { vSemaphoreDelete(_queueMutex); }
  if (_listenersMutex != nullptr) { vSemaphoreDelete(_listenersMutex); }
#if __has_include(<PicoMQTT.h>)
  if (_outgoingQueueMutex != nullptr) { vSemaphoreDelete(_outgoingQueueMutex); }
#endif
#endif
}

void MqttClient::setKeyGenerator(MqttKeyGenerator* keyGenerator) { _keyGenerator = keyGenerator; }

const MqttKeyGenerator& MqttClient::keyGenerator() const {
  return _keyGenerator != nullptr ? *_keyGenerator : _defaultKeyGenerator;
}

std::string MqttClient::resolveTopic(const char* topic) const {
  if (_keyGenerator != nullptr) {
    return _keyGenerator->key(topic);
  }
  return topic != nullptr ? std::string(topic) : std::string();
}

// ==========================================
// НАЛАШТУВАННЯ ДЛЯ PUBSUBCLIENT
// ==========================================
#if __has_include(<PubSubClient.h>)

void MqttClient::begin() {
  _instance = this;
  if (_keyGenerator == nullptr) { _keyGenerator = &_defaultKeyGenerator; }

  if (_config.useTls) {
    if (_config.caCert != nullptr) {
#if BOARD_ESP8266
      _secureClient.setInsecure();
#else
      _secureClient.setCACert(_config.caCert);
#endif
    } else {
      _secureClient.setInsecure();
    }
    _mqttClient.setClient(_secureClient);
  } else {
    _mqttClient.setClient(_plainClient);
  }

  _mqttClient.setSocketTimeout(1);
  _mqttClient.setKeepAlive(60);
  _mqttClient.setServer(_config.host, _config.port);
  _mqttClient.setBufferSize(_config.bufferSize);
  _mqttClient.setCallback(MqttClient::staticCallback);

#if defined(ESP32)
  // xTaskCreate (без пінінгу) - навмисно, не xTaskCreatePinnedToCore(core=1):
  // ESP32-C6/H2 (RISC-V) - single-core, core=1 там не існує і валить
  // assert() в xTaskCreatePinnedToCore. xTaskCreate сумісний з усіма
  // варіантами (single-core і dual-core), планувальник сам обирає ядро.
  _taskShouldRun = true;
  xTaskCreate(&MqttClient::networkTaskTrampoline, "mqtt-net",
              /*stackSize=*/8192, this, /*priority=*/5, &_networkTaskHandle);
#endif
}

void MqttClient::loop() {
#if defined(ESP32)
  // Мережевий I/O (connect/loop) виконується в networkTaskLoop().
  // Тут лише розбираємо чергу вхідних повідомлень і викликаємо колбеки
  // addListener() - В ГОЛОВНОМУ ПОТОЦІ, безпечно для дисплея/SD/touch
  // логіки всередині колбеків.
  std::vector<MqttIncomingMessage> pending;
  {
    MutexGuard guard(_queueMutex);
    pending.swap(_incomingQueue);
  }
  for (auto& msg : pending) {
    dispatchMessage(msg.topic.c_str(), msg.payload.data(),
                    static_cast<unsigned int>(msg.payload.size()));
  }
  reportDroppedMessages();
#else
  // ESP8266: без змін, кооперативний однопотоковий loop().
  if (!_mqttClient.connected()) {
    uint32_t now = millis();
    if (now - _lastReconnectAttempt >= _config.reconnectIntervalMs) {
      _lastReconnectAttempt = now;
      connect();
    }
    return;
  }
  _mqttClient.loop();
#endif
}

#if defined(ESP32)
void MqttClient::networkTaskTrampoline(void* param) {
  static_cast<MqttClient*>(param)->networkTaskLoop();
}

void MqttClient::networkTaskLoop() {
  while (_taskShouldRun) {
    {
      MutexGuard guard(_networkMutex);

      if (!_mqttClient.connected()) {
        uint32_t now = millis();
        if (now - _lastReconnectAttempt >= _config.reconnectIntervalMs) {
          _lastReconnectAttempt = now;
          connect();
        }
      } else {
        _mqttClient.loop();  // блокуючий виклик - ізольований у власному таску
      }
    }
    vTaskDelay(pdMS_TO_TICKS(10));
  }
  vTaskDelete(nullptr);
}
#endif

void MqttClient::disconnect(const char* customOfflineMessage) {
#if defined(ESP32) && __has_include(<PubSubClient.h>)
  // ВАЖЛИВО: мьютекс тут лише для PubSubClient-гілки. Для PicoMQTT він
  // навмисно відсутній - емпірично підтверджено, що утримання _networkMutex
  // під час _mqttClient.loop() (яке може тривати до socket_timeout_millis)
  // ламає CONNACK-хендшейк на ESP32-C6 (див. коментар у networkTaskLoop()).
  MutexGuard guard(_networkMutex);
#endif
  const char* message = customOfflineMessage != nullptr ? customOfflineMessage : _config.lwtOfflineMessage;
  bool hasLwtTopic = _config.lwtTopic != nullptr && _config.lwtTopic[0] != '\0';
  bool hasMessage = message != nullptr && message[0] != '\0';

  if (_mqttClient.connected() && hasLwtTopic && hasMessage) {
    std::string lwtTopic = resolveTopic(_config.lwtTopic);
    _mqttClient.publish(lwtTopic.c_str(), message, _config.lwtRetain);
  }
  _connected.store(false, std::memory_order_relaxed);
  _mqttClient.disconnect();
}

