nick-lavrik/esp32/lib/MqttClient/MqttClient.cpp
// УВАГА: викликається і з головного потоку (перша спроба конекту синхронно
// в begin()-стилі старого коду більше немає), і з networkTaskLoop() на ESP32.
// На виклик ззовні (не з networkTaskLoop()) MutexGuard тут НЕ ставимо - лок
// вже тримає викликач (networkTaskLoop бере _networkMutex до виклику connect()).
bool MqttClient::connect() {
  bool hasLwtTopic = _config.lwtTopic != nullptr && _config.lwtTopic[0] != '\0';
  bool hasOfflineMessage = _config.lwtOfflineMessage != nullptr && _config.lwtOfflineMessage[0] != '\0';
  bool hasOnlineMessage = _config.lwtOnlineMessage != nullptr && _config.lwtOnlineMessage[0] != '\0';
  bool hasLwt = hasLwtTopic && hasOfflineMessage;

  std::string lwtTopic = hasLwtTopic ? resolveTopic(_config.lwtTopic) : std::string();

  bool ok;
  if (hasLwt) {
    ok = _config.useAuth ? _mqttClient.connect(_config.clientId, _config.username, _config.password,
                                               lwtTopic.c_str(), _config.lwtQos, _config.lwtRetain,
                                               _config.lwtOfflineMessage)
                         : _mqttClient.connect(_config.clientId, lwtTopic.c_str(), _config.lwtQos,
                                               _config.lwtRetain, _config.lwtOfflineMessage);
  } else {
    ok = _config.useAuth ? _mqttClient.connect(_config.clientId, _config.username, _config.password)
                         : _mqttClient.connect(_config.clientId);
  }

  if (ok) {
    _connected.store(true, std::memory_order_relaxed);
    resubscribeAll();
    if (hasLwtTopic && hasOnlineMessage) {
      _mqttClient.publish(lwtTopic.c_str(), _config.lwtOnlineMessage, _config.lwtRetain);
    }
  }
  return ok;
}
#endif

// ==========================================
// НАЛАШТУВАННЯ ДЛЯ PICOMQTT
// ==========================================
#if __has_include(<PicoMQTT.h>)

void MqttClient::begin() {
  // _instance = this;

  if (_keyGenerator == nullptr) { _keyGenerator = &_defaultKeyGenerator; }

  // Базова конфігурація клієнта
  _mqttClient.host = _config.host;
  _mqttClient.port = _config.port;
  _mqttClient.client_id = _config.clientId;

  if (_config.useAuth) {
    _mqttClient.username = _config.username;
    _mqttClient.password = _config.password;
  }

  if (_config.lwtTopic != nullptr && _config.lwtTopic[0] != '\0') {
    // _lwtTopicStorage - член класу, живе весь час роботи клієнта.
    // PicoMQTT читає will.topic при кожній спробі конекту, не лише тут,
    // тому НЕ можна вказувати will.topic на локальний std::string (dangling
    // pointer одразу після виходу з begin()).
    _lwtTopicStorage = resolveTopic(_config.lwtTopic);
    const char* message = _config.lwtOfflineMessage != nullptr ? _config.lwtOfflineMessage : "";

    _mqttClient.will.topic = _lwtTopicStorage.c_str();
    _mqttClient.will.payload = message;
    _mqttClient.will.qos = _config.lwtQos;
    _mqttClient.will.retain = _config.lwtRetain;
  }

  _mqttClient.connected_callback = [this]() {
    _connected.store(true, std::memory_order_relaxed);
    Serial.println("[MQTT] Connected to broker successfully!");
    this->resubscribeAll();

    bool hasOnlineMessage = _config.lwtOnlineMessage != nullptr && _config.lwtOnlineMessage[0] != '\0';
    if (!_lwtTopicStorage.empty() && hasOnlineMessage) {
      _mqttClient.publish(_lwtTopicStorage.c_str(), _config.lwtOnlineMessage,
                         _config.lwtQos, _config.lwtRetain);
    }
  };

  _mqttClient.disconnected_callback = [this]() {
    _connected.store(false, std::memory_order_relaxed);
    Serial.println("[MQTT] Disconnected from broker.");
  };

  _mqttClient.connection_failure_callback = [this]() {
    _connected.store(false, std::memory_order_relaxed);
    Serial.println("[MQTT] Connect fail.");
  };

  // TODO: коли буде підключено per-topic message dispatch для PicoMQTT
  // (наразі не реалізовано - root subscribe на "#" закоментований вище в
  // історії файлу) - НЕ викликати dispatchMessage() напряму з мережевого
  // колбека. Використовувати enqueueIncoming(), як зроблено для PubSubClient
  // в handleMessage() нижче, щоб колбеки addListener() лишались у головному
  // потоці.
  _mqttClient.SubscribedMessageListener::subscribe(resolveTopic("#").c_str(), [this](const char *t, const void* m, const size_t s) {
    this->enqueueIncoming(t, (const uint8_t*)m, s);
    // this->dispatchMessage(t, (const uint8_t*)m, s);
  }, 2 * 1024);


  _mqttClient.begin();

#if defined(ESP32)
  // xTaskCreate (без пінінгу) - навмисно, не xTaskCreatePinnedToCore(core=1):
  // ESP32-C6/H2 (RISC-V) - single-core, core=1 там не існує і валить
  // assert() в xTaskCreatePinnedToCore. xTaskCreate сумісний з усіма
  // варіантами (single-core і dual-core), планувальник сам обирає ядро.
  _taskShouldRun = true;
  // priority=1 (не 5!) - навмисно, ЕМПІРИЧНО виявлено: PicoMQTT-таск на
  // priority вищому за головний loop() занадто щільно спінить available_wait()
  // (внутрішній цикл на yield(), без реальних затримок) під час послідовних
  // блокуючих wait_for_reply() викликів (CONNACK, одразу за ним SUBACK у
  // тому самому on_connect()) - це заважає lwIP вчасно доставити вхідні дані
  // на ДРУГОМУ такому виклику поспіль (перший, CONNACK, встигає; SUBACK -
  // ні). Пріоритет 1 (як головний loop()) залишає більше "повітря" для
  // WiFi/lwIP стеку. Якщо це не допоможе - наступний крок: tskIDLE_PRIORITY+1.
  xTaskCreate(&MqttClient::networkTaskTrampoline, "mqtt-net",
              /*stackSize=*/8192, this, /*priority=*/tskIDLE_PRIORITY + 1, &_networkTaskHandle);
#endif
}

void MqttClient::loop() {
#if defined(ESP32)
  std::vector<MqttIncomingMessage> pending;
  {
    MutexGuard guard(_queueMutex);
    pending.swap(_incomingQueue);
  }
  for (auto& msg : pending) {
    dispatchMessage(msg.topic.c_str(), msg.payload.data(),
                    static_cast<unsigned int>(msg.payload.size()));
  }
  reportDroppedMessages();
#else
  _mqttClient.loop();
#endif
}

#if defined(ESP32)
void MqttClient::networkTaskTrampoline(void* param) {
  static_cast<MqttClient*>(param)->networkTaskLoop();
}

void MqttClient::networkTaskLoop() {
  // ВАЖЛИВО: тут НЕМАЄ MutexGuard(_networkMutex) навколо _mqttClient.loop() -
  // навмисно, підтверджено емпірично. _mqttClient.loop() для PicoMQTT може
  // внутрішньо блокуватись на весь socket_timeout_millis (5с) під час спроби
  // конекту (wait_for_reply). Утримання мьютекса весь цей час, на пріоритеті
  // 5 (вище за головний loop(), пріоритет 1), на single-core ESP32-C6
  // призводило до 100% стабільного провалу CONNACK-хендшейку (available()
  // ніколи не бачив дані від брокера, хоча TCP-сесія встановлювалась) -
  // підтверджено ізольованими тестами: без мьютекса PicoMQTT::Client
  // конектиться миттєво навіть з окремого FreeRTOS-таска; з мьютексом -
  // 100% Connect fail. Ймовірний механізм: тривале утримання мьютекса на
  // високому пріоритеті якимось чином втручається у своєчасну доставку
  // TCP-даних у сокет-буфер на single-core C6.
  //
  // Мережевий таск - ЄДИНИЙ власник _mqttClient для будь-яких операцій
  // (connect/loop/subscribe/unsubscribe/publish). Головний потік НІКОЛИ не
  // звертається до _mqttClient напряму для PicoMQTT - лише кладе команди в
  // _outgoingQueue (drainOutgoingQueue() нижче їх виконує тут). Раніше
  // прямі виклики publish()/subscribe() з головного потоку (без мьютекса,
  // після його видалення через проблему вище) призводили до конкурентного
  // запису в сокет з двох потоків одночасно - це ламало MQTT byte stream
  // на льоту (empірично: SUBSCRIBE на кілька топіків коректно доходив до
  // брокера, потім спотворений запис читався брокером як UNSUBSCRIBE
  // невідповідного топіка, врешті протокол розсинхронізовувався і
  // з'єднання рвалось по socket_timeout).
  while (_taskShouldRun) {
    drainOutgoingQueue();
    _mqttClient.loop();
    vTaskDelay(pdMS_TO_TICKS(100));
  }
  vTaskDelete(nullptr);
}
#endif

void MqttClient::disconnect(const char* customOfflineMessage) {
  const char* message = customOfflineMessage != nullptr ? customOfflineMessage : _config.lwtOfflineMessage;
  bool hasLwtTopic = _config.lwtTopic != nullptr && _config.lwtTopic[0] != '\0';
  bool hasMessage = message != nullptr && message[0] != '\0';

  if (_mqttClient.connected() && hasLwtTopic && hasMessage) {
    std::string lwtTopic = resolveTopic(_config.lwtTopic);
#if defined(ESP32)
    // Через чергу - як і publish()/subscribe() - щоб не писати в сокет
    // конкурентно з мережевим таском (той самий клас проблем, що й
    // publish()/subscribe(), див. коментар у networkTaskLoop()).
    enqueueOutgoing(MqttOutgoingCommand::Type::kPublish, lwtTopic,
                    reinterpret_cast<const uint8_t*>(message), strlen(message), _config.lwtRetain);
#else
    _mqttClient.publish(lwtTopic.c_str(), message, _config.lwtQos, _config.lwtRetain);
#endif
  }
}

bool MqttClient::connect() {
  return _mqttClient.connected();
}
#endif

// ==========================================
// СПІЛЬНІ МЕТОДИ ДЛЯ ПУБЛІКАЦІЙ ТА ЛІСТЕНЕРІВ
// ==========================================

bool MqttClient::flushOutgoing(uint32_t timeoutMs) {
#if defined(ESP32) && __has_include(<PicoMQTT.h>)
  const uint32_t start = millis();
  bool empty = false;

  while (true) {
    {
      MutexGuard guard(_outgoingQueueMutex);
      empty = _outgoingQueue.empty();
    }
    if (empty || millis() - start >= timeoutMs) {
      break;
    }
    vTaskDelay(pdMS_TO_TICKS(20));
  }

  if (empty) {
    // Черга порожня, але мережевий таск міг забрати її щойно і ще не добити
    // publish у сокет - даємо йому один свій цикл (vTaskDelay(100) в
    // networkTaskLoop()).
    vTaskDelay(pdMS_TO_TICKS(120));
  }
  return empty;
#else
  // PubSubClient / ESP8266: publish виконується синхронно, чекати нічого.
  (void)timeoutMs;
  return true;
#endif
}

void MqttClient::reportDroppedMessages() {
#if defined(ESP32)
  uint32_t incoming = _droppedIncoming.exchange(0, std::memory_order_relaxed);
  uint32_t outgoing = _droppedOutgoing.exchange(0, std::memory_order_relaxed);
  if (incoming > 0 || outgoing > 0) {
    Logger::warn("[MQTT] черга переповнена, відкинуто: %u вхідних, %u вихідних",
                 (unsigned)incoming, (unsigned)outgoing);
  }
#endif
}

