nick-lavrik/esp32/lib/MqttClient/MqttClient.cpp
bool MqttClient::publish(const char* topic, const char* payload, bool retained) {
  std::string fullTopic = resolveTopic(topic);
#if __has_include(<PubSubClient.h>)
#if defined(ESP32)
  MutexGuard guard(_networkMutex);
#endif
  return _mqttClient.publish(fullTopic.c_str(), payload, retained);
#elif __has_include(<PicoMQTT.h>)
#if defined(ESP32)
  enqueueOutgoing(MqttOutgoingCommand::Type::kPublish, fullTopic,
                  reinterpret_cast<const uint8_t*>(payload), strlen(payload), retained);
#else
  _mqttClient.publish(fullTopic.c_str(), payload, 0, retained);
#endif
  return true;
#endif
}

bool MqttClient::publish(const char* topic, const uint8_t* payload, unsigned int length, bool retained) {
  std::string fullTopic = resolveTopic(topic);
#if __has_include(<PubSubClient.h>)
#if defined(ESP32)
  MutexGuard guard(_networkMutex);
#endif
  return _mqttClient.publish(fullTopic.c_str(), payload, length, retained);
#elif __has_include(<PicoMQTT.h>)
#if defined(ESP32)
  enqueueOutgoing(MqttOutgoingCommand::Type::kPublish, fullTopic, payload, length, retained);
#else
  std::string strPayload(reinterpret_cast<const char*>(payload), length);
  _mqttClient.publish(fullTopic.c_str(), strPayload.c_str(), 0, retained);
#endif
  return true;
#endif
}

bool MqttClient::subscribe(const char* topic) {
  std::string fullTopic = resolveTopic(topic);
#if __has_include(<PubSubClient.h>)
#if defined(ESP32)
  MutexGuard guard(_networkMutex);
#endif
  return _mqttClient.subscribe(fullTopic.c_str());
#elif __has_include(<PicoMQTT.h>)
#if defined(ESP32)
  enqueueOutgoing(MqttOutgoingCommand::Type::kSubscribe, fullTopic);
#else
  _mqttClient.PicoMQTT::BasicClient::subscribe(fullTopic.c_str());
#endif
  return true;
#endif
}

bool MqttClient::unsubscribe(const char* topic) {
  std::string fullTopic = resolveTopic(topic);
#if __has_include(<PubSubClient.h>)
#if defined(ESP32)
  MutexGuard guard(_networkMutex);
#endif
  return _mqttClient.unsubscribe(fullTopic.c_str());
#elif __has_include(<PicoMQTT.h>)
#if defined(ESP32)
  enqueueOutgoing(MqttOutgoingCommand::Type::kUnsubscribe, fullTopic);
#else
  _mqttClient.PicoMQTT::BasicClient::unsubscribe(fullTopic.c_str());
#endif
  return true;
#endif
}

#if defined(ESP32) && __has_include(<PicoMQTT.h>)
void MqttClient::enqueueOutgoing(MqttOutgoingCommand::Type type, const std::string& topic,
                                 const uint8_t* payload, unsigned int length, bool retained) {
  MqttOutgoingCommand cmd;
  cmd.type = type;
  cmd.topic = topic;
  cmd.retained = retained;
  if (payload != nullptr && length > 0) {
    cmd.payload.assign(payload, payload + length);
  }
  MutexGuard guard(_outgoingQueueMutex);
  // drop-oldest, як і для _incomingQueue: якщо мережевий таск не встигає
  // (немає з'єднання, а головний потік продовжує publish-ити), черга не має
  // з'їдати купу.
  if (_outgoingQueue.size() >= kMaxOutgoingQueue) {
    _outgoingQueue.erase(_outgoingQueue.begin());
    _droppedOutgoing.fetch_add(1, std::memory_order_relaxed);
  }
  _outgoingQueue.push_back(std::move(cmd));
}

// Викликається виключно з networkTaskLoop() (мережевий таск) - єдине місце,
// де _mqttClient.subscribe()/unsubscribe()/publish() реально виконуються
// для PicoMQTT.
void MqttClient::drainOutgoingQueue() {
  std::vector<MqttOutgoingCommand> pending;
  {
    MutexGuard guard(_outgoingQueueMutex);
    pending.swap(_outgoingQueue);
  }
  for (auto& cmd : pending) {
    switch (cmd.type) {
      case MqttOutgoingCommand::Type::kSubscribe:
        // Явно кваліфіковано BasicClient:: - без цього виклик резолвиться
        // в PicoMQTT::Client/SubscribedMessageListener::subscribe(topic,
        // callback=nullptr) (high-level API, name hiding ховає
        // BasicClient::subscribe), що лише кладе запис у внутрішню мапу
        // з null-колбеком замість реального мережевого SUBSCRIBE - саме
        // це спричиняло фантомний UNSUBSCRIBE, підтверджено емпірично.
        // _mqttClient.PicoMQTT::BasicClient::subscribe(cmd.topic.c_str());
        _mqttClient.SubscribedMessageListener::subscribe(
          cmd.topic.c_str(),
          [this](const char* t, const void* payload, size_t len) {
            this->enqueueIncoming(t, (const uint8_t*)payload, len);
          },
          2 * 1024);
        break;
      case MqttOutgoingCommand::Type::kUnsubscribe:
        // _mqttClient.PicoMQTT::BasicClient::unsubscribe(cmd.topic.c_str());
        _mqttClient.SubscribedMessageListener::unsubscribe(cmd.topic.c_str());
        break;
      case MqttOutgoingCommand::Type::kPublish: {
        std::string strPayload(reinterpret_cast<const char*>(cmd.payload.data()), cmd.payload.size());
        _mqttClient.publish(cmd.topic.c_str(), strPayload.c_str(), 0, cmd.retained);
        break;
      }
    }
  }
}
#endif

// addListener()/removeListener(): _listeners захищений _listenersMutex.
// Фактичний subscribe (для PicoMQTT) - через чергу, виконується мережевим
// таском, а не напряму з головного потоку (див. коментар у networkTaskLoop()).
MqttListenerId MqttClient::addListener(const char* topic, MqttListenerCallback callback) {
  MqttListenerEntry entry;
  entry.id = _nextListenerId++;
  entry.topic = resolveTopic(topic).c_str();
  entry.callback = callback;
  {
#if defined(ESP32)
    MutexGuard guard(_listenersMutex);
#endif
    _listeners.push_back(entry);
  }

  if (_mqttClient.connected()) {
#if __has_include(<PubSubClient.h>)
#if defined(ESP32)
    MutexGuard guard(_networkMutex);
#endif
    _mqttClient.subscribe(entry.topic.c_str());
#elif __has_include(<PicoMQTT.h>)
#if defined(ESP32)
    enqueueOutgoing(MqttOutgoingCommand::Type::kSubscribe, entry.topic.c_str());
#else
    // Явно кваліфіковано BasicClient:: - див. коментар у drainOutgoingQueue().
    _mqttClient.PicoMQTT::BasicClient::subscribe(entry.topic.c_str());
#endif
#endif
  }
  return entry.id;
}

bool MqttClient::publishJson(const char* topic, JsonDocument& doc, bool retained) {
  size_t size = measureJson(doc);
  std::vector<char> buffer(size + 1);
  serializeJson(doc, buffer.data(), buffer.size());
  return publish(topic, reinterpret_cast<const uint8_t*>(buffer.data()), size, retained);
}

MqttListenerId MqttClient::addJsonListener(const char* topic, std::function<void(const char*, JsonDocument&)> callback) {
  return addListener(topic, [callback](const char* topic, const uint8_t* payload, unsigned int length) -> void {
        JsonDocument doc;
        DeserializationError error = deserializeJson(doc, payload, length);
        if (error) { return; }
        callback(topic, doc);
      });
}

