nick-lavrik/esp32/lib/MqttClient/MqttClient.cpp
MqttListenerId MqttClient::addStringListener(const char* topic, MqttStringListenerCallback callback) {
  return addListener(topic, [callback](const char* messageTopic, const uint8_t* payload, unsigned int length) -> void {
        std::vector<char> buffer(length + 1);
        memcpy(buffer.data(), payload, length);
        buffer[length] = '\0';
        callback(messageTopic, buffer.data());
      });
}

void MqttClient::removeListener(MqttListenerId id) {
#if defined(ESP32)
  MutexGuard guard(_listenersMutex);
#endif
  for (auto& entry : _listeners) {
    if (entry.id == id) {
      entry.markedForRemoval = true;
      return;
    }
  }
}

void MqttClient::cleanupRemovedListeners() {
#if defined(ESP32)
  MutexGuard guard(_listenersMutex);
#endif
  _listeners.erase(std::remove_if(_listeners.begin(), _listeners.end(),
                     [](const MqttListenerEntry& entry) { return entry.markedForRemoval; }), _listeners.end());
}

// resubscribeAll() - ВАЖЛИВО: НЕ тримає MutexGuard(_listenersMutex) під час
// самих subscribe()-викликів. Спочатку знімаємо снепшот топіків під локом
// (швидко), відпускаємо мьютекс, і вже потім виконуємо блокуючі subscribe()
// БЕЗ жодного мьютекса. Той самий клас проблем, що й з _networkMutex
// (див. networkTaskLoop()): тримання БУДЬ-ЯКОГО FreeRTOS-мьютекса (навіть
// повністю без конкуренції за нього) під час блокуючого PicoMQTT
// wait_for_reply() ламає читання відповіді на ESP32-C6 - empірично
// підтверджено ізольованим тестом (з MutexGuard - SUBACK ніколи не
// приходить, розрив через socket_timeout; без нього - стабільно).
void MqttClient::resubscribeAll() {
  std::vector<std::string> topicsSnapshot;
  {
#if defined(ESP32)
    MutexGuard guard(_listenersMutex);
#endif
    topicsSnapshot.reserve(_listeners.size());
    for (const auto& entry : _listeners) {
      if (entry.markedForRemoval) { continue; }
      topicsSnapshot.emplace_back(entry.topic.c_str());
    }
  }
  for (const auto& topic : topicsSnapshot) {
#if __has_include(<PubSubClient.h>)
    _mqttClient.subscribe(topic.c_str());
#elif __has_include(<PicoMQTT.h>)
    // Явно кваліфіковано BasicClient:: - див. коментар у drainOutgoingQueue().
    _mqttClient.PicoMQTT::BasicClient::subscribe(topic.c_str());
#endif
  }
}

void MqttClient::dispatchMessage(const char* topic, const uint8_t* payload, unsigned int length) {
  // Матчинг топіка робимо ПІД локом (MqttTopicMatcher::match - чиста й дешева
  // функція), а копіюємо лише колбеки тих слухачів, що реально підійшли -
  // зазвичай нуль або один. Раніше тут копіювався ВЕСЬ _listeners (String +
  // std::function на кожен запис) на КОЖНЕ повідомлення; при підписці на "#"
  // це десятки алокацій на секунду.
  //
  // Копія колбека все одно потрібна: викликати його під локом не можна -
  // колбек може сам звернутись до addListener()/removeListener(), а це
  // deadlock на нерекурсивному мьютексі.
  //
  // _dispatchScratch - член класу, щоб переюзати вже виділену capacity між
  // викликами. Викликається лише з loop() (головний потік) і не реентрантний.
  _dispatchScratch.clear();
  {
#if defined(ESP32)
    MutexGuard guard(_listenersMutex);
#endif
    for (const auto& entry : _listeners) {
      if (entry.markedForRemoval || !entry.callback) { continue; }
      if (!MqttTopicMatcher::match(entry.topic.c_str(), topic)) { continue; }
      _dispatchScratch.push_back(entry.callback);
    }
  }

  for (auto& callback : _dispatchScratch) {
    callback(topic, payload, length);
  }
  _dispatchScratch.clear();  // не тримаємо копії колбеків між викликами

  cleanupRemovedListeners();
}

/* bool MqttClient::isConnected() const {
#if __has_include(<PubSubClient.h>)
  return const_cast<PubSubClient&>(_mqttClient).connected();
#elif __has_include(<PicoMQTT.h>)
  return const_cast<PicoMQTT::Client&>(_mqttClient).connected();
#endif
} */

void MqttClient::enqueueIncoming(const char* topic, const uint8_t* payload, unsigned int length) {
#if defined(ESP32)
  MqttIncomingMessage msg;
  msg.topic.assign(topic);
  msg.payload.assign(payload, payload + length);

  MutexGuard guard(_queueMutex);
  // drop-oldest: краще втратити найстаріше повідомлення, ніж купу (див.
  // kMaxIncomingQueue). Про факт втрати повідомить loop() головного потоку.
  if (_incomingQueue.size() >= kMaxIncomingQueue) {
    _incomingQueue.erase(_incomingQueue.begin());
    _droppedIncoming.fetch_add(1, std::memory_order_relaxed);
  }
  _incomingQueue.push_back(std::move(msg));
#endif
}

#if __has_include(<PubSubClient.h>)
void MqttClient::handleMessage(char* topic, uint8_t* payload, unsigned int length) {
#if defined(ESP32)
  // Викликається мережевим таском (з _mqttClient.loop() всередині
  // networkTaskLoop()) - не можна напряму викликати dispatchMessage(),
  // бо колбеки addListener() мають виконуватись у головному потоці.
  enqueueIncoming(topic, payload, length);
#else
  dispatchMessage(topic, payload, length);
#endif
}

void MqttClient::staticCallback(char* topic, uint8_t* payload, unsigned int length) {
  if (_instance != nullptr) { _instance->handleMessage(topic, payload, length); }
}
#endif

#endif // HAS_MQTT_CLIENT
